export const POSTS = [
    {
        index: 1,
        title: "Название поста 1",
        description:
            "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях.",
        author: '0Nickname0',
        date :'11.12.2001'
    },
    {
        index: 2,
        title: "Название поста 2",
        description:
            "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях.",
        author: '0Nickname0',
        date :'11.12.2001'
    }
];