import React, {Component} from 'react';
import MainPage from "../components/MainPage";
import '../components/Rules.css';

class Rules extends Component {
    render() {
        return (
            <div>
                <MainPage/>
                <div className='main-block-rul'></div>
                <div className='main-block-rul-text'> Правила пользования сайтом</div>
                <div className='main-block-rul-text-2'> Настоящие Условия оказания услуг («Условия») составляют
                    юридически обязательное соглашение («Соглашение») между вами («вы») и Компанией (как указано ниже)
                    регулирующее ваш доступ и использование вебсайта Компании SocialSphere, включая любые субдомены
                    (совместно, «Сайт»), и все связанные услуги (совместно «Услуги»). Сайт и Услуги в дальнейшем
                    совместно именуются как «Платформа». Сбор и использование персональных данных, осуществляемые
                    Компанией в связи с вашим доступом и использованием Платформы Бусти описаны в нашей Политике
                    Конфиденциальности, включенной посредством ссылки в настоящее Соглашение. ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО
                    ОЗНАКОМЬТЕСЬ С НАСТОЯЩИМ СОГЛАШЕНИЕМ. РЕГИСТРИРУЯСЬ, ПОЛУЧАЯ ДОСТУП, ПРОСМАТРИВАЯ ИНФОРМАЦИЮ,
                    СКАЧИВАЯ МАТЕРИАЛЫ ИЛИ ИСПОЛЬЗУЯ ПЛАТФОРМУ БУСТИ, ВЫ (А) ПРИЗНАЕТЕ, ЧТО ВЫ ПРОЧИТАЛИ, ПОНЯЛИ И
                    ПРИНИМАЕТЕ УСЛОВИЯ НАСТОЯЩЕГО СОГЛАШЕНИЯ, И (В) НАСТОЯЩИМ ПОДТВЕРЖДАЕТЕ, ЧТО ВАШ ВОЗРАСТ ДОСТАТОЧЕН
                    ДЛЯ ТАКОЙ РЕГИСТРАЦИИ В СООТВЕТСТВИИ С ПРИМЕНИМЫМ ЗАКОНОДАТЕЛЬСТВОМ И/ИЛИ ЧТО У ВАС ЕСТЬ ВСЕ
                    НЕОБХОДИМЫЕ СОГЛАСИЯ (НАПРИМЕР, СОГЛАСИЕ РОДИТЕЛЕЙ) В ПОЛНОМ СООТВЕТСТВИИ С ПРИМЕНИМЫМ
                    ЗАКОНОДАТЕЛЬСТВОМ, ВКЛЮЧАЯ СОГЛАСИЕ ДЛЯ ЦЕЛЕЙ ЗАКОНОДАТЕЛЬСТВА О ЗАЩИТЕ ИНФОРМАЦИИ, В ИНОМ СЛУЧАЕ
                    РЕГИСТРАЦИЯ НА ПЛАТФОРМЕ БУСТИ И ЕЕ ИСПОЛЬЗОВАНИЕ ЗАПРЕЩЕНЫ. В СЛУЧАЕ ЕСЛИ ВАМ, В СООТВЕТСВИИ С
                    ЗАКОНОДАТЕЛЬСТВОМ ВАШЕГО ГОСУДАРСТВА, ЗАПРЕЩЕНО ИСПОЛЬЗОВАТЬ ПЛАТФОРМУ БУСТИ ИЛИ ЕЕ ЧАСТИ, ИЛИ ЕСЛИ
                    ЕСТЬ ИНЫЕ ПРАВОВЫЕ ОГРАНИЧЕНИЯ, У ВАС НЕТ ПРАВА ИСПОЛЬЗОВАТЬ ЕЕ. В ТАКОМ СЛУЧАЕ ВЫ БУДЕТЕ
                    САМОСТОЯТЕЛЬНО НЕСТИ ОТВЕТСТВЕННОСТЬ ЗА ИСПОЛЬЗОВАНИЕ ПЛАТФОРМЫ БУСТИ ИЛИ РЕЛЕВАНТНОЙ ЕЕ ЧАСТИ НА
                    ТЕРРИТОРИИ ВАШЕГО ГОСУДАРСТВА С НАРУШЕНИЕМ ПРИМЕНИМОГО ЗАКОНОДАТЕЛЬСТВА.
                    Объем Услуг
                    Платформа Бусти является онлайн платформой, которая (a) позволяет одним зарегистрированным
                    пользователям («Авторам») использовать её доступный функционал для вступления в юридически
                    обязывающие соглашения с другими пользователями («Пользователи») для предоставления Пользователям
                    доступа к контенту и/или его части, созданному Авторами и опубликованному в блогах Авторов или Чатах
                    на Платформе («Контент Автора»), на безвозмездной основе или за вознаграждение, размер которого
                    определён Автором («Вознаграждение Автора»); (b) позволяет
                </div>
            </div>
        );
    }
}

export default Rules;